---
kind: property
id: P:Autodesk.Revit.DB.Opening.Host
source: html/6f603c8c-7644-4d71-a6d2-e3bca22b6c27.htm
---
# Autodesk.Revit.DB.Opening.Host Property

Retrieves the host element of this opening.

## Syntax (C#)
```csharp
public Element Host { get; }
```